001=-391.07,-673.153,-73.618,235.07,0,0,1,0,0,0=圆盘mark点1安全位坐标
002=-391.07,-673.153,-73.618,235.07,0,0,1,0,0,0=圆盘mark点1坐标
003=452.254,750.011,-156.488,53.3634,0,0,1,0,0,0=圆盘mark点2安全坐标
004=652.255,550.01,-56.4882,53.3629,0,0,1,0,0,0=圆盘mark点2坐标
005=652.255,-10.01,-56.4882,53.3629,0,0,2,0,0,0=圆盘mark点3安全坐标
006=702.255,-10.0111,-56.4882,53.3618,0,0,0,0,0,0=圆盘mark点3坐标
007=-421.07,-727.154,-52.6175,235.069,0,0,1,0,0,0=圆盘mark点4安全坐标
008=-513.516,-613.611,-58.4428,249.352,0,0,1,0,0,0=圆盘mark点4坐标
009=64.8025,871.932,-49.6686,188.61,0,0,1,0,0,0=圆盘mark点5安全坐标
010=64.8025,871.932,-109.668,188.61,0,0,1,0,0,0=圆盘mark点5坐标
011=-55.1969,871.932,-109.668,188.609,0,0,1,0,0,0=圆盘mark点6安全坐标
012=-55.1969,871.932,-49.6686,188.609,0,0,1,0,0,0=圆盘mark点6坐标
013=-175.197,811.933,-49.6686,188.61,0,0,1,0,0,0=圆盘mark点7安全坐标
014=-175.197,811.933,-109.668,188.61,0,0,1,0,0,0=圆盘mark点7坐标
015=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点8安全坐标
016=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点8坐标
017=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点9安全坐标
018=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点9坐标
019=63.6159,492.631,-318.168,130.354,0,0,1,0,0,0=圆盘mark点10安全坐标
020=62.6161,487.631,-318.168,130.353,0,0,1,0,0,0=圆盘mark点10坐标拍照1RR标定坐标
021=99.2203,564.201,-318.168,188.838,0,0,1,0,0,0=圆盘mark点11安全坐标
022=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点11坐标
023=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点12安全坐标
024=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点12坐标
025=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点13安全坐标
026=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点13坐标
027=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点14安全坐标
028=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点14坐标
029=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点15安全坐标
030=-590.07,417.849,-24.618,331.069,0,0,1,0,0,0=圆盘mark点15坐标
031=409.927,817.847,-74.6183,331.07,0,0,1,0,0,0=圆盘mark点16安全坐标
032=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点16坐标
033=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点17安全坐标
034=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点17坐标
035=394.8,771.933,-59.668,188.609,0,0,1,0,0,0=圆盘mark点18安全坐标
036=46446=圆盘mark点18坐标
037=234.802,761.932,-39.6677,188.61,0,0,1,0,0,0=圆盘mark点19安全坐标
038=234.802,761.932,-139.668,188.61,0,0,1,0,0,0=圆盘mark点19坐标
039=164.8,811.932,-49.6686,188.61,0,0,1,0,0,0=圆盘mark点20安全坐标
040=164.8,811.932,-119.667,188.61,0,0,1,0,0,0=圆盘mark点20坐标
041=64.8025,871.932,-49.6686,188.61,0,0,1,0,0,0=圆盘mark点21安全坐标
042=64.8025,871.932,-109.668,188.61,0,0,1,0,0,0=圆盘mark点21坐标
043=-55.1969,871.932,-109.668,188.609,0,0,1,0,0,0=圆盘mark点22安全坐标
044=-55.1969,871.932,-49.6686,188.609,0,0,1,0,0,0=圆盘mark点22坐标
045=-175.197,811.933,-49.6686,188.61,0,0,1,0,0,0=圆盘mark点23安全坐标
046=-175.197,811.933,-109.668,188.61,0,0,1,0,0,0=圆盘mark点23坐标
047=-664.024,233.327,-301.068,0.484978,0,0,1,0,0,0=圆盘mark点24安全坐标离开基准位
048=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点24坐标
049=-643.023,125.325,-411.068,0.486458,0,0,1,0,0,0=圆盘mark点25安全坐标
050=-643.023,125.325,-411.068,0.486458,0,0,1,0,0,0=圆盘mark点25坐标上料校准位
051=-664.023,113.326,-406.068,0.485466,0,0,1,0,0,0=圆盘mark点26安全坐标吸料位
052=-664.023,113.326,-350.068,0.485466,0,0,1,0,0,0=圆盘mark点26坐标基准取料位基准位
053=-664.023,113.326,-300.068,0.485466,0,0,1,0,0,0=圆盘mark点27安全坐标
054=-664.023,113.326,-318.068,0.485466,0,0,1,0,0,0=圆盘mark点27坐标
055=-664.023,113.326,-318.068,0.485466,0,0,1,0,0,0=圆盘mark点28安全坐标
056=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点28坐标
057=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点29安全坐标
058=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点29坐标
059=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点30安全坐标
060=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点30坐标
061=-345.693,613.338,-289.986,434.74,0,0,1,0,0,0=圆盘mark点31安全坐标
062=-654.024,107.329,-340.068,-183.51537,0,0,1,0,0,0=圆盘mark点31坐标
063=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点32安全坐标
064=-651.766,108.197,-381.425,272.921,0,0,1,0,0,0=圆盘mark点32坐标
065=-651.766,108.197,-381.425,272.921,0,0,1,0,0,0=上料位校准标定位
066=-664.023,113.326,-340.068,270.485466,0,0,1,0,0,0=上料位取料基准安全位
067=-664.023,113.326,-358.068,270.486,0,0,1,0,0,0=上料位取料基准位
068=-551.765,408.198,-300.425,272.921,0,0,1,0,0,0=离开上料取料位
069=-664.023,113.326,-356.068,0.485466,0,0,1,0,0,0=圆盘mark点17坐标
070=-554.023,408.326,-351.068,270.485,0,0,1,0,0,0=旋转90度气缸2离开位
071=-665.023,122.325,-340.069,270.485,0,0,1,0,0,0=旋转90度气缸2上料基准安全位
072=-665.023,122.325,-358.068,270.485,0,0,1,0,0,0=旋转90度气缸2上料基准位
073=-140.024,533.327,-326.068,0.482819,0,0,1,0,0,0=放料标定位
074=-140.024,533.327,-326.068,0.480713,0,0,1,0,0,0=拍照位
075=394.8,771.933,-59.668,188.609,0,0,1,0,0,0=圆盘mark点17坐标
076=-404.072,-665.153,-74.6183,245.07,0,0,1,0,0,0=拍照位1-2气缸3
077=-493.069,-622.154,-72.6178,245.07,0,0,1,0,0,0=拍照位1-1气缸3
078=-462.069,-668.154,-72.6178,335.069,0,0,1,0,0,0=放料位1-1气缸3
079=-462.069,-668.154,-5.6178,335.069,0,0,1,0,0,0=放料位1-1上方气缸3
080=-628.8,-263.094,-343.198,253.908,0,0,1,0,0,0=安全位1
081=-628.8,-263.094,-3.1975,253.908,0,0,1,0,0,0=安全位1上方
082=-508.798,-523.095,-3.1975,253.908,0,0,1,0,0,0=安全位2
083=-125.307,460.66,-145.068,258.212,0,0,1,0,0,0=下相机拍照位
084=-296.071,-720.154,-74.6183,245.069,0,0,1,0,0,0=拍照位2-1气缸3
085=-207.072,-763.154,-74.6183,245.069,0,0,1,0,0,0=拍照位2-2气缸3
086=-396.072,-425.153,-349.019,245.069,0,0,1,0,0,0=拍照位3-1气缸3
087=-307.074,-468.154,-349.019,245.067,0,0,1,0,0,0=拍照位3-2气缸3
088=-306.073,-468.155,-346.619,245.068,0,0,1,0,0,0=圆盘mark点17坐标
089=394.8,771.933,-59.668,188.609,0,0,1,0,0,0=圆盘mark点17坐标
090=394.8,771.933,-59.668,188.609,0,0,1,0,0,0=圆盘mark点17坐标
091=-551.765,408.198,-281.425,272.921,0,0,1,0,0,0=wfdsgfd
092=394.8,771.933,-59.668,188.609,0,0,1,0,0,0=圆盘mark点17坐标
093=394.8,771.933,-59.668,188.609,0,0,1,0,0,0=圆盘mark点17坐标
094=394.8,771.933,-59.668,188.609,0,0,1,0,0,0=圆盘mark点17坐标
095=394.8,771.933,-59.668,188.609,0,0,1,0,0,0=圆盘mark点17坐标
096=394.8,771.933,-59.668,188.609,0,0,1,0,0,0=圆盘mark点17坐标
097=394.8,771.933,-59.668,188.609,0,0,1,0,0,0=圆盘mark点17坐标
098=394.8,771.933,-59.668,188.609,0,0,1,0,0,0=圆盘mark点17坐标
099=394.8,771.933,-59.668,188.609,0,0,1,0,0,0=圆盘mark点17坐标
100=394.8,771.933,-59.668,188.609,0,0,1,0,0,0=圆盘mark点17坐标
101=-336.073,-425.153,-349.019,245.068,0,0,1,0,0,0=圆盘mark点17坐标
102=102.026,560.468,-318.168,194.28,0,0,1,0,0,0=123123